//======================================================toggleMenu===========================================================
	// menu
	const toggleMenu = () => {
		const btnMenuElem = document.querySelector('.menu'),		// элементы со тсраницы кнопка header
			menuElem = document.querySelector('menu');				// элементы со тсраницы див с меню
		//======================================================handlerMenu===========================================================
		const handlerMenu = () => {
			menuElem.classList.toggle('active-menu');	 		// навешивание стилей на див
		};
		//==============================================\\\\\\\handlerMenu===========================================================
		//===================================================слушатели==============================================================
		btnMenuElem.addEventListener('click', handlerMenu);			// слушатель на закрытие меню
		menuElem.addEventListener('click', event => {
			const target = event.target;
			if (target.classList.contains('close-btn')) {		// проверки на вложенность получение close-btn
				handlerMenu();									// запуск функции handlerMenu
			} else {
				if (target.closest('ul>li>a')) { 				// получаем ближайший родительский элемент ul>li>a
					handlerMenu();								// запуск функции handlerMenu
				}
			}
		});
		//==============================================\\\\\\\слушатели===========================================================
	};
	//==============================================\\\\\\\toggleMenu===========================================================

	
	export default toggleMenu;